#include <iostream>
using namespace std;

/*
    А хүснэгтийн сондгой элементүүдийн арифметик дундажыг олох
    
    Params
    А хүснэгт, а хүснэгтийн хэмжээ
    
    Return
    double арифметик дундаж
*/
double odd_average(int a[], int n)
{
	// сондгой тооны нийлбэр болон тоог зарлаж өгнө
	double sum = 0.0;
	double j = 0.0;

	// сондгой тооны нийлбэр болон тоог олно
	for (int i = 0; i < n; i++)
	{
		if (a[i] % 2 == 1)
		{
			sum += a[i];
			j++;
		}
	}

	// нөхцөл шалгаж сондгой тоо байхгүй үед 0-ийг буцаана, эсрэг тохиолдолд арифметик дундажийг буцаана
	if (j == 0)
		return 0;
	else
		return sum / j;
}

int main()
{
	int n;
	// хүснэгтийн хэмжээг оруулсан
	cin >> n;

	// n элементтэй хүснэгт үүсгэж утгыг нь гараас оруулсан
	int a[n];
	for (int i = 0; i < n; i++)
	{
		cin >> a[i];
	}

	// сондгой утгуудын арифметик дундаж олох функцийг дуудан дэлгэцэнд харуулах
	cout << odd_average(a, n) << endl;

	return 0;
}