#include <iostream>
#include <cstdlib>
using namespace std;

/*
	Өгөгдсөн n тооны оронг олно

	Params:
	int n - оронг нь олох гэж буй тоо

	Return:
	int оронгийн тоо
*/
int findOron(int n)
{
	int j = 0;

	// n хасах үед эерэг болгонг
	if (n < 0)
		n = -n;

	// n-с 10 бага болон 0тэй тэнцүү их үед 1 оронтой байна
	if (n >= 0 && n < 10)
		return 1;
	else
	{
		// n тоо 1-ээс бага болтол давтана
		while (n >= 1)
		{
			// n тоог 10т хуваагаад
			n = n / 10;
			// тоолуурыг 1-ээр ихэсгэнэ
			++j;
		}

		return j;
	}
}

/*
	Өгөгдсөн n тооны цифрүүдийг олно

	Params:
	int n - n тоо
	int a - n тооны орон

	Return:
	int заагч - цифрүүдийн хүснэгтийн эхний байрлал
*/
int *findNums(int n, int a)
{
	// n тооны цифрүүдийг хадгалах хүснэгтийг заах заагч хувьсагч үүсгэх
	int *b = (int *)malloc(sizeof(n) * a);

	// n хасах үед эерэг болгонг
	if (n < 0)
		n = -n;

	//
	for (int i = 0; i < a; i++)
	{
		// Сүүлчийн оронг олох
		int num = n % 10;

		// n тоог багасгана - 10т хуваана
		n /= 10;

		// олсон цифрээ i дахь элементэд хадгална
		*(b + i) = num;
	}

	return b;
}

int main()
{
	int n;
	// хүснэгтийн хэмжээг оруулсан
	cin >> n;

	// n тооны оронг олоод а хувьсагчид хадгална
	int a = findOron(n);

	// n тооны оронг хэвлэнэ
	cout << a << endl;

	// заагч arr-д findNums-аас буцсан утгыг хадгална
	int *arr = findNums(n, a);

	// хойноос нь хэвлэнэ
	for (int i = (a - 1); i >= 0; i--)
	{
		cout << arr[i] << " ";
	}

	cout << endl;

	// тухайн заагчийн байрлалд байгаа хүснэгтийг чөлөөлнө
	free(arr);

	return 0;
}