#include "./employee.h"

int main()
{
    // Ажилчин төрлйин emp гэсэн объект байгуулна
    employee emp;
    
    // Ажилчин объект emp-р дамжуулан init функцийг дуудна
    emp.init();
    // Ажилчин объект emp-р дамжуулан read функцийг дуудна
    emp.read();

    // Гишүүн ажилчны ажилсан цагийг хадаглах бодит тоон хувьсагч зарлана 
    float hour;
    // Гишүүн ажилчны ажилсан цагийг гараас оруулна
    cin >> hour;
    // Гишүүн ажилчны ажилсан цагийг add_worked_hour-г ашиглна нэмнэ emp объектын ажилсан цаг дээр нэмнэ
    emp.add_worked_hour(hour);

    // Ажилчин объект emp-р дамжуулан calculate_salary функцийг ашиглан  хэвлэнэ
    cout << emp.calculate_salary() << endl;

    // Ажилчин объект emp-р дамжуулан print функцийг ашиглан emp объектын мэдээллийг хэвлэнэ
    emp.print();
}
