#include <iostream>;
using namespace std;

int main()
{
	// а гэсэн бүхэл тоо зарлаж, түүнд 125 гэсэн анхны утга оноож өгнө
	int a = 125;

	// p гэсэн бүхэл тоон хаяган хувьсагч зарлаж, а-н хаягийг p-д оноож өгнө
	int *p = &a;

	// p буюу а-н хаягийг хэлнэ
	cout << p << endl;

	// р-н утга буюу а-н хаягийг дам хандалтын оператор ашиглан тухайн хаяг дээр байгаа утгыг хэвлэнэ - 125
	cout << *p << endl;

	// p хувьсагч дээр 1-г нэмэх ба энэ заагч нь бүхэл тоон төрөл 4 byte-р нэмэгдэж &a + 4 болно.
	p++;

	// р-т оноогдсон шинэ хаягийг хэвлэнэ
	cout << p << endl;

	// Дам хандалтын оператор ашиглан шинэ хаягт байгаа утгыг хэвлэнэ
	cout << *p << endl;
}