#include <iostream>;
using namespace std;

int main()
{
	// Бүхэл тоон 5 элементтэй хүснэгт зарлана
	int numbers[5];

	// Бүхэл тоон хаяган хувьсагч зарлана
	int *p;

	// р-д бүхэл тоон хүснэгтийн анхны элементийн хаягийг өгнө
	p = numbers;

	// р-н анхны утга 10 болж байна.
	*p = 10;

	// р-н утга буюу number-н эхний элементийн хаягийг 1-ээр нэмж дараагийн элементийн хаягийг авна
	p++;

	// number хүснэгтийн 2-р элементэд 20 гэсэн утга онооно
	*p = 20;

	// р-д number-н 3-р элементийн хаягийг өгнө
	p = &numbers[2];

	// number-н 3-р элементийг 30 болгоно
	*p = 30;

	// р-д number хүснэгтийн 4-р элементийн утгыг оноож өгнө
	p = numbers + 3;

	// number-н 4 дахь элементийг 40 болгоно
	*p = 40;

	// р-д number хүснэгтийн анхны элементийн хаягийг өгнө
	p = numbers;

	// р-д эхний хаяг дээр sizeof(int) * 4-р нэмж number хүснэгтийн
	// 5 дахь элементийн утгыг 50 болгоно
	*(p + 4) = 50;

	// number-н эхний 5 элементийг хэвлэж харуулна
	for (int n = 0; n < 5; n++)
		cout << numbers[n] << ", ";
}