#include <iostream>
using namespace std;

int main()
{
	// Хаяган хувьсагч зарлах
	int *p_a;

	// 2 удаа давтах for давталт үүсгэх
	for (int i = 0; i < 2; i++)
	{
		// а гэсэн бүхэл тоон хаяган хувьсагч зарлаж түүнд new int-с нөөцөлсөн хаягийг оноож өгнө
		int *a = new int;

		// p_a-т а-н хаягийг өгнө
		p_a = a;

		// а-н хаяган дээр байгаа утгыг i болгоно
		*a = i;

		// а-н хаяган дээр байгаа утгыг хэвлэнэ
		cout << "*a = " << *a << endl;
	}

	// p_a-н хаяган дээр байгаа утгыг хэвлэнэ
	cout << "p_a = " << *p_a << endl;
	// p_a дээр нөөцөлсөн санах ойг устгана
	delete p_a;
	return 0;
}